查看有几块磁盘 fdisk -l


df 是来自于coreutils 软件包，系统安装时，就自带的；我们通过这个命令可以查看磁盘的使用情况以及文件系统被挂载的位置； 
示例：
```shell
[root@localhost ~]# df -l 
文件系统                 容量       已用       可用    已用% 挂载点 
/dev/sda3              4956316   3565088   1135396 76% / 
tmpfs                   241320         12    241308   1%   /dev/shm 
/dev/sda6              4806904   2523708   2039012 56% /media/disk 
/dev/sda1              4956284   3529796   1170656 76% /media/_ 
/dev/sda5              4845056   2581484   2019388 57% /media/disk-1 
```

说明：Linux系统的分区格式使用的是xyzN的格式，xy表示的是硬盘类型，如上面的执行结果，sd表示是SCSI硬盘，z表示的是硬盘序号，第一块硬盘是a，第二块硬盘是b，所以要查询Linux系统上有几块硬盘，只要注意这一点即可。N表示的是分区号。
显然，示例中的Linux系统只有一块硬盘。
